app/controllers/projects_controller.rb

  def index
    get_user
    @projects = Project.where(user_id: @user.id)
---
SELECT "projects".* FROM "projects"  WHERE "projects"."user_id" = 2

  def create
    @project = Project.new(project_params)

    if @project.save
---
INSERT INTO "projects" ("created_at", "note", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-07 00:02:05.372972"], ["note", "lsjdflkdf"], ["title", "moaarrrrrr"], ["updated_at", "2014-07-07 00:02:05.372972"], ["user_id", 1]]

  def update
    get_project
    get_user
    @project.update!(project_params)
---
UPDATE "projects" SET "note" = ?, "updated_at" = ? WHERE "projects"."id" = 16  [["note", "STRINGS"], ["updated_at", "2014-07-07 03:41:33.294285"]]