app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."project_id" IS NULL
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = 2 LIMIT 1
---
  def index
    get_project
    @tasks = []
    @tasks = Task.where(project_id: params[:project_id])

    if @tasks.empty?

INSERT INTO "tasks" ("created_at", "note", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-07-09 01:32:30.399368"], ["note", "tests"], ["project_id", 16], ["title", "moooooar"], ["updated_at", "2014-07-09 01:32:30.399368"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = 2  [["completed", "t"], ["updated_at", "2014-07-09 01:29:04.614959"]]
---
  def complete
    get_task
    @task.toggle!(:completed)